<!-- dflook/terraform-github-actions {"workspace":"plan-summary-outputs-2","backend":"05ac8dc2c72337df4c90930280b091b340c168ee79ee64bef901ba1990cdacbb","backend_type":"remote"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __plan-summary-outputs-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables="from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #17](https://github.com/dflook/terraform-github-actions/actions/runs/2266490870)